export const MAIN_STARS_INTERPRETATIONS: Record<string, {
  name: string;
  character: string;
  title: string;
  description: string;
}> = {
  '紫微': {
    name: '紫微星',
    character: '周文王的长子伯邑考',
    title: '帝座',
    description: '掌『尊贵』为『帝座』育万物，形貌厚重，腰背肥满，为人忠厚老实，谦恭耿直，又有自负倾向，耳根软易受影响，善变、多疑、心地狭小，易感情用事，主权威显贵略带倨傲之气。'
  },
  '天机': {
    name: '天机星',
    character: '姜子牙',
    title: '智能之神',
    description: '司掌『智能』、『精神』主思想，化气为善，化忌为恶，脸细长身材适中，不高不矮，个性急，谈吐斯文，神经过敏多愁善感，有异性缘。'
  },
  '太阳': {
    name: '太阳星',
    character: '纣王之忠臣比干',
    title: '光明之神',
    description: '司掌『光明』、『博爱』权贵之星能文能武，相貌方圆体格雄壮，化忌则干瘦高，男性坦率女性有男子态，个性强异性缘佳，不论男女心直口快，喜争论易生气，做事积极不偏袒，喜外交活动善交朋友。'
  },
  '武曲': {
    name: '武曲星',
    character: '文王的儿子姬发即周武王',
    title: '财富之神',
    description: '司掌『财富』、『武勇』、『寿』，又为寡宿之星不利女命，面白晰、额宽、眉粗、毛发粗硬、性格刚毅，诚实信用，重义气、直性子、死不认输，有新奇点子，作事有板有眼。'
  },
  '天同': {
    name: '天同星',
    character: '周文王',
    title: '温顺之神',
    description: '司掌『温顺』、『协调』，天同星主福又主寿，什么都好不拒绝、不积极的个性，面貌似孩童，体形胖圆，幽默、人缘好，不与人计较，知足常乐，女命醉心罗曼蒂克中，加桃花星置身于小说的感情生活中。'
  },
  '廉贞': {
    name: '廉贞星',
    character: '纣王的大臣费仲',
    title: '邪恶之神',
    description: '司掌『邪恶』、『歪曲』化杀为囚，为次桃花，身长体健，精神旺、有野性美，记忆力好，个性硬，好冒险，好赌、风流，女命气质好，清秀端庄，冷艳。'
  },
  '天府': {
    name: '天府星',
    character: '纣王之妻姜皇后',
    title: '才艺之神',
    description: '司掌『才能』、『慈悲』形貌清秀，面红齿白，心性温良、聪明、机变、安份守己，有竞争力不认输，女命清秀高雅，理智重于感情，喜布置家，重穿著及审美。'
  },
  '太阴': {
    name: '太阴星',
    character: '黄飞虎之妻贾夫人',
    title: '清洁之神',
    description: '司掌『清洁』、『住宅』，面色白晰微黄，男命有女态，聪明、文雅、温顺、小心、有肚量、耐心、重感情、爱干净，化忌不爱干净，和女性相处不好。'
  },
  '贪狼': {
    name: '贪狼星',
    character: '妲己',
    title: '欲望之神',
    description: '司掌『欲望』、『物质』，贪狼化气为桃花，又为标准，可福可祸，脸色青白或黄白，男貌性格，女貌艳丽，生活多采多姿，不拘小节，喜吃喝爱过夜生活、善交际。敢赚敢花，多才多艺，喜神仙之学，感情不定，博爱随和，化忌者好赌，入水乡者桃花处处开。'
  },
  '巨门': {
    name: '巨门星',
    character: '姜子牙之妻马千金',
    title: '是非之神',
    description: '司掌『是非』、『疑惑』，巨门主口舌、是非、食禄、口才、窃星，眼光锐利善察颜观色，反应佳、有辩才、喜号研究学术有分析理解力，记忆力、联想力，女命不宜，好处是细心，坏处是多疑，爱情常变。'
  },
  '天相': {
    name: '天相星',
    character: '纣王之忠臣闻太师',
    title: '奉仕之神',
    description: '司掌『慈爱』、『服务』为福善化气为印，偏文事，相貌敦厚，诚实不虚伪，对人诚恳、随和、慷慨、有同情心爱自由、打抱不平、喜结识权贵，女命好打扮、贪吃挑食、有笑容、一辈子不愁吃穿。'
  },
  '天梁': {
    name: '天梁星',
    character: '李靖',
    title: '恒常之神',
    description: '司掌『恒常』、『统率』化气为荫，为福寿，形貌厚重清秀，行事大方、成熟，阅历丰富，胆大心大，喜出风头，有赌性，吹牛，一副龙头老大的德性，女命天梁老大姐心性，有男子志，能照顾人。'
  },
  '七杀': {
    name: '七杀星',
    character: '黄飞虎',
    title: '战斗之神',
    description: '司掌『威猛』、『肃杀』，冲动、风险、大变动，经常头兴兴尾冷冷，脸型方长，身高体壮，刚毅之相，不喜欢他人管束，敢冲敢冒险，喜怒哀乐行于色。'
  },
  '破军': {
    name: '破军星',
    character: '纣王',
    title: '破耗之神',
    description: '司掌『破损』、『消耗』，破军之变动为主将，故知善于冲锋陷阵，身材五短、背厚肩宽、任性狂傲、遇事多疑、投机冒险、喜新事物、喜破坏现状，加以变化改革，言语不拘，男命不重外表，女命反之且虚荣、浪费、神经质。'
  }
}; 