import { HeavenlyStem } from './stems';
import { StarName } from './stars';

export type Hua = '禄' | '权' | '科' | '忌';
export type HuaLetter = 'A' | 'B' | 'C' | 'D';

export const SIHUA_MAP: Record<HeavenlyStem, Record<Hua, StarName>> = {
    '甲': { '禄': '廉贞', '权': '破军', '科': '武曲', '忌': '太阳' },
    '乙': { '禄': '天机', '权': '天梁', '科': '紫微', '忌': '太阴' },
    '丙': { '禄': '天同', '权': '天机', '科': '文昌', '忌': '廉贞' },
    '丁': { '禄': '太阴', '权': '天同', '科': '天机', '忌': '巨门' },
    '戊': { '禄': '贪狼', '权': '太阴', '科': '右弼', '忌': '天机' },
    '己': { '禄': '武曲', '权': '贪狼', '科': '天梁', '忌': '文曲' },
    '庚': { '禄': '太阳', '权': '武曲', '科': '太阴', '忌': '天同' },
    '辛': { '禄': '巨门', '权': '太阳', '科': '文曲', '忌': '文昌' },
    '壬': { '禄': '天梁', '权': '紫微', '科': '左辅', '忌': '武曲' },
    '癸': { '禄': '破军', '权': '巨门', '科': '太阴', '忌': '贪狼' },
};

export const HUA_TO_LETTER: Record<Hua, HuaLetter> = {
    '禄': 'A',
    '权': 'B',
    '科': 'C',
    '忌': 'D',
}; 