import { HeavenlyStem } from "./stems";

/**
 * The Ten Gods in Bazi.
 * 比肩 (Bi Jian), 劫财 (Jie Cai), 食神 (Shi Shen), 伤官 (Shang Guan), 偏财 (Pian Cai),
 * 正财 (Zheng Cai), 七杀 (Qi Sha), 正官 (Zheng Guan), 偏印 (Pian Yin), 正印 (Zheng Yin)
 */
export const TEN_GODS = [
  '比肩', '劫财', '食神', '伤官', '偏财', '正财', '七杀', '正官', '枭神', '正印'
] as const;

export type TenGod = typeof TEN_GODS[number];

type TenGodsRelation = {
  [key in HeavenlyStem]: TenGod;
};

export const TEN_GODS_RELATIONS: { [key in HeavenlyStem]: TenGodsRelation } = {
  '甲': { '甲': '比肩', '乙': '劫财', '丙': '食神', '丁': '伤官', '戊': '偏财', '己': '正财', '庚': '七杀', '辛': '正官', '壬': '枭神', '癸': '正印' },
  '乙': { '甲': '劫财', '乙': '比肩', '丙': '伤官', '丁': '食神', '戊': '正财', '己': '偏财', '庚': '正官', '辛': '七杀', '壬': '正印', '癸': '枭神' },
  '丙': { '甲': '枭神', '乙': '正印', '丙': '比肩', '丁': '劫财', '戊': '食神', '己': '伤官', '庚': '偏财', '辛': '正财', '壬': '七杀', '癸': '正官' },
  '丁': { '甲': '正印', '乙': '枭神', '丙': '劫财', '丁': '比肩', '戊': '伤官', '己': '食神', '庚': '正财', '辛': '偏财', '壬': '正官', '癸': '七杀' },
  '戊': { '甲': '七杀', '乙': '正官', '丙': '枭神', '丁': '正印', '戊': '比肩', '己': '劫财', '庚': '食神', '辛': '伤官', '壬': '偏财', '癸': '正财' },
  '己': { '甲': '正官', '乙': '七杀', '丙': '正印', '丁': '枭神', '戊': '劫财', '己': '比肩', '庚': '伤官', '辛': '食神', '壬': '正财', '癸': '偏财' },
  '庚': { '甲': '偏财', '乙': '正财', '丙': '七杀', '丁': '正官', '戊': '枭神', '己': '正印', '庚': '比肩', '辛': '劫财', '壬': '食神', '癸': '伤官' },
  '辛': { '甲': '正财', '乙': '偏财', '丙': '正官', '丁': '七杀', '戊': '正印', '己': '枭神', '庚': '劫财', '辛': '比肩', '壬': '伤官', '癸': '食神' },
  '壬': { '甲': '食神', '乙': '伤官', '丙': '偏财', '丁': '正财', '戊': '七杀', '己': '正官', '庚': '枭神', '辛': '正印', '壬': '比肩', '癸': '劫财' },
  '癸': { '甲': '伤官', '乙': '食神', '丙': '正财', '丁': '偏财', '戊': '正官', '己': '七杀', '庚': '正印', '辛': '枭神', '壬': '劫财', '癸': '比肩' },
}; 