{
  "slip_4": {
    "zh_CN": {
      "title": "第四签 小秦王三跳涧 甲丁 下吉",
      "content": "去年百事颇相宜，若较今年时运低\n怜惜失脚猿啼树，失足难登空马骑",
      "basic_interpretation": "此签运势下降，较往年逊色。意示当前运势有如失足的猿猴，难以攀登高处。凡事宜守不宜进，应谨慎等待时机。求神护佑，避免因轻举妄动而遭遇不顺。",
      "detailed_breakdown": {
        "事业": "运势较弱，不宜冒进求变。宜守成待机，耐心等候良机再动。急于求成只会适得其反，应以稳健为主。",
        "财运": "财运下滑，投资需谨慎。避免大额投资或投机，量入为出。守住现有财产比追求新财更重要。",
        "婚姻": "感情发展不顺，宜退守观望。已婚者需包容体谅，未婚者不宜急于求成。耐心等待时机成熟。",
        "健康": "注意身体保养，防止意外受伤。运动时要格外小心，避免跌倒摔伤。定期体检，早防早治。",
        "学业": "学习运势一般，需付出更多努力。不宜好高骛远，踏实基础比追求难题更重要。",
        "出行": "出行不利，易遇阻滞。如非必要，暂缓出行计划。若必须出行，需提前做好充分准备。",
        "求职": "求职运势较差，暂时不宜频繁投递简历。宜先提升自身能力，等待更好的机会。",
        "官司": "诉讼不利，宜和解收场。强行争执可能败诉，以和为贵才是上策。",
        "失物": "寻找失物困难，多半难以寻回。不要抱过高期望，做好损失的心理准备。",
        "疾病": "病情反复，恢复缓慢。需耐心调养，不可操之过急。遵医嘱服药，保持乐观心态。",
        "买卖": "交易不利，价格难以如意。买方易吃亏，卖方难获利。时机不佳，宜暂缓决定。",
        "求子": "求子之路不顺，需耐心等待。调理身体，保持良好心态，勿急躁求成。"
      },
      "historical_context": {
        "张翰忆鲈鱼": "晋代张翰在洛阳做官，见秋风起，思念故乡的鲈鱼美味和莼菜羹，遂辞官归乡，后人称赞其能知进退。此典故示意应当审时度势，知难而退。",
        "小秦王三跳涧": "传说中小秦王骑马遇深涧，连跳三次才过，但第三次失足跌落。寓意虽有勇气，但过于冒险终致失败。劝人做事要量力而行，不可逞强。"
      },
      "symbolism": "猿啼树示意失足之忧，空马骑象征努力徒劳。整体寓意当前运势低落，诸事不宜勉强，应当审慎收敛，等待转机。"
    },
    "zh_TW": {
      "title": "第四籤 小秦王三跳澗 甲丁 下吉",
      "content": "去年百事頗相宜，若較今年時運低\n憐惜失腳猿啼樹，失足難登空馬騎",
      "basic_interpretation": "此籤運勢下降，較往年遜色。意示當前運勢有如失足的獼猴，難以攀登高處。凡事宜守不宜進，應謹慎等待時機。求神護佑，避免因輕舉妄動而遭遇不順。",
      "detailed_breakdown": {
        "事業": "運勢較弱，不宜冒進求變。宜守成待機，耐心等候良機再動。急於求成只會適得其反，應以穩健為主。",
        "財運": "財運下滑，投資需謹慎。避免大額投資或投機，量入為出。守住現有財產比追求新財更重要。",
        "婚姻": "感情發展不順，宜退守觀望。已婚者需包容體諒，未婚者不宜急於求成。耐心等待時機成熟。",
        "健康": "注意身體保養，防止意外受傷。運動時要格外小心，避免跌倒摔傷。定期體檢，早防早治。",
        "學業": "學習運勢一般，需付出更多努力。不宜好高騖遠，踏實基礎比追求難題更重要。",
        "出行": "出行不利，易遇阻滯。如非必要，暫緩出行計劃。若必須出行，需提前做好充分準備。",
        "求職": "求職運勢較差，暫時不宜頻繁投遞履歷。宜先提升自身能力，等待更好的機會。",
        "官司": "訴訟不利，宜和解收場。強行爭執可能敗訴，以和為貴才是上策。",
        "失物": "尋找失物困難，多半難以尋回。不要抱過高期望，做好損失的心理準備。",
        "疾病": "病情反覆，恢復緩慢。需耐心調養，不可操之過急。遵醫囑服藥，保持樂觀心態。",
        "買賣": "交易不利，價格難以如意。買方易吃虧，賣方難獲利。時機不佳，宜暫緩決定。",
        "求子": "求子之路不順，需耐心等待。調理身體，保持良好心態，勿急躁求成。"
      },
      "historical_context": {
        "張翰憶鱸魚": "晉代張翰在洛陽做官，見秋風起，思念故鄉的鱸魚美味和蓴菜羹，遂辭官歸鄉，後人稱讚其能知進退。此典故示意應當審時度勢，知難而退。",
        "小秦王三跳澗": "傳說中小秦王騎馬遇深澗，連跳三次才過，但第三次失足跌落。寓意雖有勇氣，但過於冒險終致失敗。勸人做事要量力而行，不可逞強。"
      },
      "symbolism": "猿啼樹示意失足之憂，空馬騎象徵努力徒勞。整體寓意當前運勢低落，諸事不宜勉強，應當審慎收斂，等待轉機。"
    },
    "en_US": {
      "title": "Slip #4: Young Prince Qin's Three Leaps Across the Ravine | Jia-Ding | Lower Fortune",
      "content": "Last year all affairs went rather well,\nCompared to this year's luck that seems to fell.\nPity the ape that slips from crying tree,\nFailed footing leaves the rider horseless, free.",
      "basic_interpretation": "This divination indicates declining fortune compared to previous years. Your current luck is like that of an ape that has lost its footing, unable to climb to higher ground. In all matters, it's better to maintain than to advance. Be cautious and wait for the right moment. Pray for divine protection and avoid hasty actions that may lead to misfortune.",
      "detailed_breakdown": {
        "Career": "Your professional fortune is weak; avoid risky ventures or major changes. Focus on maintaining current position and patiently wait for better opportunities. Rushing toward success will backfire - stability should be your priority.",
        "Wealth": "Financial fortune is declining; investment requires caution. Avoid large investments or speculation, live within your means. Preserving existing assets is more important than pursuing new wealth.",
        "Marriage": "Romantic development faces obstacles; maintain a defensive position and observe. Married couples need tolerance and understanding; singles shouldn't rush into relationships. Wait patiently for the right timing.",
        "Health": "Pay attention to body maintenance and prevent accidental injuries. Be extra careful during exercise to avoid falls or injuries. Regular health checkups and early prevention are essential.",
        "Studies": "Academic fortune is average; requires more effort. Avoid being overly ambitious - solid foundation work is more important than tackling difficult problems.",
        "Travel": "Travel is unfavorable and prone to obstacles. If not necessary, postpone travel plans. If travel is essential, make thorough preparations in advance.",
        "Job Seeking": "Job hunting prospects are poor; avoid frequent resume submissions for now. Focus on improving your skills first and wait for better opportunities.",
        "Legal Matters": "Litigation is unfavorable; seek reconciliation. Forceful disputes may result in defeat - harmony and compromise are the better strategy.",
        "Lost Items": "Finding lost items is difficult; most likely won't be recovered. Don't maintain high expectations; prepare mentally for the loss.",
        "Illness": "Condition may fluctuate with slow recovery. Patient care is needed; don't rush the healing process. Follow medical advice, take prescribed medicine, and maintain optimism.",
        "Business": "Transactions are unfavorable with unsatisfactory pricing. Buyers may suffer losses, sellers struggle to profit. Poor timing - consider postponing decisions.",
        "Conception": "The path to having children faces obstacles; patient waiting is required. Focus on body conditioning, maintain good mental state, and avoid impatience."
      },
      "historical_context": {
        "Zhang Han's Longing for Bass": "During the Jin Dynasty, Zhang Han served as an official in Luoyang. When autumn winds arose, he missed the delicious bass and water shield soup from his hometown, so he resigned and returned home. Later generations praised his ability to know when to advance and retreat. This allusion suggests one should assess situations wisely and retreat when facing difficulties.",
        "Young Prince Qin's Three Leaps": "Legend tells of Young Prince Qin encountering a deep ravine while riding. He attempted three leaps to cross it, but fell on the third attempt. This symbolizes that while courage is admirable, excessive risk-taking ultimately leads to failure. It advises people to act within their capabilities and not be overly aggressive."
      },
      "symbolism": "The crying ape in the tree represents anxiety about missteps, while the empty horse ride symbolizes futile efforts. Overall, this signifies that current fortune is low, forcing matters is inadvisable, and one should act cautiously while waiting for a turning point."
    }
  }
}