{
  "zh-TW": [
    {
      "slip_number": 1,
      "title": "第一籤 上上籤",
      "content": "天開地闢結良緣\n日吉時良萬事全\n若得此籤非小可\n人行忠正帝王宣",
      "basic_interpretation": "此籤大吉。天地開泰，良緣天成，時機極佳，萬事亨通。若能心懷忠義，行事正直，必得上天庇佑，貴人提攜，前程似錦。",
      "historical_context": "此籤取自《三國演義》中劉備三顧茅廬請諸葛亮的典故。劉備以誠待人，諸葛亮被其誠意感動，結為君臣，共創蜀漢大業。",
      "symbolism": "天開地闢象徵新的開始，結良緣意指遇到貴人相助。日吉時良代表時機成熟，萬事全表示諸事順遂。"
    },
    {
      "slip_number": 2,
      "title": "第二籤 張子房遊赤松 甲乙 上吉",
      "content": "盈虛消息總天時\n自此君當百事宜\n若問前程歸縮地\n更須方寸好修為",
      "basic_interpretation": "此籤上吉。盈滿虛空，生滅盛衰，乃是天時的循環，一個人處世，如果能夠順天時，自然樣樣好。如果想前途無阻礙，一路風順，須要心地好好修為向善才行。曾經遇到不順遂的過去，到現在也該是轉運的時候了，之後會漸入佳境，但不可因此而驕縱。如能從心做起，隨時隨地都能發出善的念頭，積累福蔭，必會有美好的未來。此簽的重點在於心裡的想法，如能以善念出發，必能排除萬難達成目標，但如有偏斜的歹念，則會為自己招來厄運，不可不慎。問婚姻，表示有成功的希望。如果問訴訟，則和解為宜。問疾病，則宜多禱告神明保佑。應考功名，有希望，但不可心躁。求財平平，做事業宜按步就班，不可好高騖遠，才不致失敗。總之，不妄動，再正心修德，自然安泰。",
      "historical_context": "子房名良。韓國人。自博浪沙事後（指行弒秦始皇）匿下邳。遊圮上遇衣褐老夫。墮履命良取跪進之。老夫曰。孺子可教。越五日授以太公兵法。謂後十三年。濟北穀城山下。黃石即我也。後良佐（漢）高祖定天下。封留侯。因感鳥盡弓藏。謝病歸入白雲山。師事黃石號赤松子。從前有一少年患病，占得此籤，不久即去逝，正應在「前程歸縮地」一句。又有一人問行人，占得此籤，不數日其人兼程而至，亦應了「縮地」之句。",
      "symbolism": "盈虛消息指事物的盈滿虛空循環變化，天時代表自然時序規律。前程歸縮地意為前路需要收斂謹慎，方寸好修為強調內心品德修養的重要性。縮地典故來自仙人能縮地成寸的神通，寓意時空變化莫測。"
    },
    {
      "slip_number": 3,
      "title": "第三籤 賈誼遇漢文帝 甲丙 中吉",
      "content": "衣食自然生處有\n勸君不用苦勞心\n但能孝悌存忠信\n福祿來成禍不侵",
      "basic_interpretation": "此籤中吉。此簽只宜守舊，不可貪求，但存中直，卻得兩平。須以孝悌忠信為本，自有福祿來成之應，若思強取強求，反招意外之禍，占者循理守分則吉。一個人在世，只要照本份去做，衣食自然不用愁。俗云：「命裡有時終須有，命裡無時莫強求。」強求富貴，徒勞心力，反致傷憂。如果在家事親至孝，兄弟友愛，在外待人忠信自然內外無怨，禍患不侵。正是：「富貴前定，何須強求，動合循理，天必佑之。隨緣安份，直道而行，心中無愧，自然和平。」抽得此籤，表示只宜守舊，不可貪求。心中存著正直，自然無憂。問謀事，雖有成功的希望，但時間上恐久延。談婚姻，在時間上也是比較遲延。問訴訟，則以和解為宜。問疾病，目前還無法痊癒，尚須待一段時間。",
      "historical_context": "貾谊遇汉文帝：漢·賈誼，洛陽人。文帝時河南守吳薦之，後為博士。年二十餘超遷，歲中至大中大夫。請改正朔，興禮樂，上《治安策》。絳、灌等毀之，出為長沙王太傅。誼既謫去，渡湘水作賦，弔屈原。論者謂：賈生，王佐才，遇漢文明主，終不大用，卒悲傷而死，豈非天意乎？張公藝九世同居：張公藝，台前縣孫口鄉橋北張人，生於公元578年，卒於公元676年，歷北齊、北周、隋、唐四代，壽九十九歲。公藝自幼有成德之望，正德修身，禮讓齊家，立義和廣堂。制典則，設條教以戒子侄，是以父慈子孝，兄友弟和，夫正婦順，姑婉媳聽，九代同居，合家九百人。道光年間有一人，自恃有錢，想有錢捐得官爵，到廟抽得此簽。人家勸他做富家翁，不必妄想做官，他不聽，後來花了好多錢，仍無法實現企圖，一氣死在旅途上，正應了這首簽詩的前二句。",
      "symbolism": "衣食自然有指基本生活需求天然具足，不用苦勞心代表無需過度憂慮操心。孝悌忠信是做人的根本四德，福祿來成表示自然會有好運降臨，禍不侵意為災禍邪惡不會侵擾正直之人。"
    }
  ],
  "en-US": [
    {
      "slip_number": 1,
      "title": "First Oracle - Most Auspicious",
      "content": "Heaven opens, earth forms, good relationships bind\nAuspicious day, favorable time, all matters align\nIf you receive this oracle, it is no small thing\nWalk in loyalty and righteousness, the emperor will sing your name",
      "basic_interpretation": "This oracle is most auspicious. Heaven and earth are in harmony, good relationships are destined, timing is perfect, and all matters will proceed smoothly. If you maintain loyalty and act righteously, you will receive divine protection and support from nobles, leading to a bright future.",
      "historical_context": "This oracle references the story from \"Romance of the Three Kingdoms\" where Liu Bei visited Zhuge Liang three times to seek his service. Liu Bei's sincerity moved Zhuge Liang, and together they built the Shu Han dynasty.",
      "symbolism": "Heaven opening and earth forming symbolizes new beginnings, while good relationships represent meeting helpful people. Auspicious day and favorable time indicate perfect timing, and all matters aligning suggests everything will go smoothly."
    },
    {
      "slip_number": 2,
      "title": "Second Oracle - Zhang Zifang Visits Red Pine, Jiayi Most Auspicious",
      "content": "Abundance and emptiness follow heavenly timing\nFrom now on all matters will be favorable for you\nIf you ask about your future path, it leads to transcendence\nYou must cultivate your heart and moral character well",
      "basic_interpretation": "This oracle is most auspicious. Fullness and emptiness, birth and death, prosperity and decline are all part of heaven's natural cycles. If one can follow heaven's timing in worldly affairs, everything will naturally go well. If you want an unobstructed future path with smooth sailing, you must cultivate your heart toward goodness. Past difficulties are now transforming into good fortune, and things will gradually improve, but don't become arrogant. If you can start from the heart, always maintaining good thoughts and accumulating blessings, you will have a beautiful future. The key of this oracle lies in your mental state - with good intentions you can overcome all difficulties to achieve your goals, but evil thoughts will bring misfortune. For marriage, there is hope for success. For lawsuits, settlement is advisable. For illness, pray more to deities for protection. For examinations and career, there is hope but don't be impatient. Wealth is average, business should proceed step by step without unrealistic ambitions to avoid failure. In summary, don't act rashly, focus on rectifying your heart and cultivating virtue, and peace will naturally follow.",
      "historical_context": "Zhang Zifang (Zhang Liang) was from the state of Han. After the Bolangsha incident (attempting to assassinate the First Emperor), he hid in Xiapi. Walking on a bridge, he met an old man in brown clothes who dropped his shoe and asked Zhang to retrieve it while kneeling. The old man said 'This young man can be taught' and five days later gave him the military strategies of Duke Tai. He said 'In thirteen years, at the foot of Gucheng Mountain in Jibei, the yellow stone will be me.' Later Zhang assisted Emperor Gaozu of Han in conquering the world and was enfeoffed as Marquis of Liu. Feeling that 'when birds are gone, the bow is stored away,' he retired due to illness to White Cloud Mountain to study under Yellow Stone, also known as Red Pine Master. In the past, a young man fell ill and drew this oracle; he died soon after, fulfilling the line 'future path leads to transcendence.' Another person asking about a traveler drew this oracle, and within days the person arrived quickly, also fulfilling the 'transcendence' reference.",
      "symbolism": "Abundance and emptiness refer to the cyclical changes of fullness and void in all things, while heavenly timing represents natural temporal order. 'Future path leads to transcendence' means the road ahead requires restraint and caution, while 'cultivate your heart well' emphasizes the importance of inner moral cultivation. The transcendence allusion comes from immortals' supernatural ability to shrink distances, symbolizing the unpredictability of time and space changes."
    },
    {
      "slip_number": 3,
      "title": "Third Oracle - Jia Yi Meets Emperor Wen of Han, Jiabing Moderately Auspicious",
      "content": "Food and clothing naturally exist where you live\nI advise you not to worry and toil your heart\nIf you can be filial, brotherly, loyal and trustworthy\nFortune will come and misfortune cannot intrude",
      "basic_interpretation": "This oracle is moderately auspicious. This oracle suggests maintaining the status quo rather than being greedy, staying upright to achieve balance. Make filial piety, brotherly love, loyalty and trustworthiness your foundation, and fortune will naturally come - but if you try to force or grab things, you'll attract unexpected misfortune. Those who follow principles and know their place will be blessed. A person in this world need only fulfill their proper duties, and food and clothing will naturally be provided. As the saying goes: 'What is destined will come, what isn't shouldn't be forced.' Forcing wealth and status only wastes energy and brings sorrow. If you serve parents with filial piety at home, love your siblings, and treat others with loyalty and trustworthiness outside, there will be no resentment within or without, and disasters cannot intrude. Truly: 'Wealth and status are predetermined, why force them? Act according to principles and heaven will protect you. Accept your fate with contentment, walk the righteous path, have no guilt in your heart, and peace will naturally follow.' Drawing this oracle means you should maintain the old ways, not be greedy. Keep righteousness in your heart and worries will disappear. For planning matters, though there's hope for success, it may take longer. For marriage, timing will also be delayed. For lawsuits, settlement is best. For illness, recovery isn't possible yet and will require more time.",
      "historical_context": "Jia Yi meets Emperor Wen of Han: Jia Yi of the Han dynasty was from Luoyang. During Emperor Wen's reign, Governor Wu of Henan recommended him, and he became a scholar. In his twenties he was promoted, reaching Grand Palace Grandee within a year. He petitioned to reform the calendar, revive rituals and music, and submitted the 'Policy for Peace and Order.' Jiang, Guan and others slandered him, so he was sent out as tutor to the King of Changsha. After being banished, Jia Yi crossed the Xiang River and wrote a rhapsody mourning Qu Yuan. Commentators said: Jia Yi had the talent to assist kings, met the enlightened Emperor Wen, but was never greatly employed and died of sorrow - wasn't this heaven's will? Zhang Gongyi's nine generations living together: Zhang Gongyi was from Qiaobei Zhang village, Sunkou township, Taiqian county, born in 578 CE and died in 676 CE, living through the Northern Qi, Northern Zhou, Sui and Tang dynasties for ninety-nine years. From youth he showed promise of virtue, cultivated righteousness, managed his family with propriety, and established principles and teachings to guide his descendants. Thus fathers were kind and sons filial, brothers were loving and harmonious, husbands righteous and wives obedient, mothers-in-law gentle and daughters-in-law compliant. Nine generations lived together with 900 family members. During the Daoguang period, a man relied on his wealth and wanted to buy an official title. He drew this oracle at a temple. People advised him to be content as a wealthy man and not dream of being an official, but he didn't listen. Later he spent much money but couldn't achieve his goal and died of anger while traveling, fulfilling the first two lines of this oracle.",
      "symbolism": "Food and clothing naturally existing means basic life needs are naturally provided. Not worrying and toiling your heart means no need for excessive anxiety or manipulation. Filial piety, brotherly love, loyalty and trustworthiness are the four fundamental virtues of being human. Fortune coming means good luck will naturally arrive, and misfortune not intruding means disasters and evil cannot disturb righteous people."
    }
  ]
}