{
  "slip_5": {
    "zh_CN": {
      "title": "第五签 吕蒙正守困 甲戊 中平",
      "content": "子有三般不自由，\n门庭萧索冷如秋。\n若逢牛鼠交承日，\n万事回春不用忧。",
      "basic_interpretation": "此时万事无法随心所欲，连简单的沟通都词不达意，如秋日萧条，门庭冷落。但厄运终会结束，当子丑交替之时，如春天来临，万事回春，无需忧愁。这是黎明前的黑暗，需要耐心等待转机。",
      "detailed_breakdown": {
        "功名": "勤奋努力也暂时不见成效，运势衰落，不见曙光。但终将有出头之日，需要持续坚持。",
        "求财": "目前无利可图，勤业之人虽本应有报酬，但时运不济，只好忍受。将来必有转机。",
        "婚姻": "平凡夫妻亦可知足，命中注定的缘分需要接受。须慎重考虑，不宜急躁。",
        "健康": "身体需要调养，曾经历险情，幸好及时医治。不宜迷信，保持理智清醒。",
        "学业": "学习进展缓慢，需要更多耐心和坚持。基础工作比追求高深更重要。",
        "出行": "可以出行，但需小心谨慎，不可冒险。该回来时就要及时返回。",
        "求职": "就业机会暂时有限，但不要放弃。时机到来时会有好的机会出现。",
        "官司": "诉讼对己不利，最好通过中介和解。不必争一时意气，以和为贵。",
        "失物": "失物在东南方向，需要反省自己的过失。物品可能尚存，需要用心寻找。",
        "疾病": "病情可以医治，有痊愈的希望。需要耐心治疗，不可急躁。",
        "买卖": "生意兴衰交替，令人无奈。这是世道常情，只好忍耐等待时机。",
        "求子": "人丁平安，虽无突出之处，但平凡已足够令人满足。"
      },
      "historical_context": {
        "吕蒙正守困": "北宋吕蒙正，字圣功，河南人。父亲吕龟图与母亲不合，蒙正少时贫困，曾投靠龙门山洞穴中苦读。后在太宗时举试第一，官至宰相，累封许国公，谥文穆。其早年困顿但后来飞黄腾达的经历，正应了此签先困后通的寓意。"
      },
      "symbolism": "子丑交替象征时运的转换，萧索的秋日代表当前的困境，回春则象征希望和新生。三般不自由指寿、富、贵三样都不能自主，但天命有时，终会转机。"
    },
    "zh_TW": {
      "title": "第五籤 呂蒙正守困 甲戊 中平",
      "content": "子有三般不自由，\n門庭蕭索冷如秋。\n若逢牛鼠交承日，\n萬事回春不用憂。",
      "basic_interpretation": "此時萬事無法隨心所欲，連簡單的溝通都詞不達意，如秋日蕭條，門庭冷落。但厄運終會結束，當子丑交替之時，如春天來臨，萬事回春，無需憂愁。這是黎明前的黑暗，需要耐心等待轉機。",
      "detailed_breakdown": {
        "功名": "勤奮努力也暫時不見成效，運勢衰落，不見曙光。但終將有出頭之日，需要持續堅持。",
        "求財": "目前無利可圖，勤業之人雖本應有報酬，但時運不濟，只好忍受。將來必有轉機。",
        "婚姻": "平凡夫妻亦可知足，命中註定的緣分需要接受。須慎重考慮，不宜急躁。",
        "健康": "身體需要調養，曾經歷險情，幸好及時醫治。不宜迷信，保持理智清醒。",
        "學業": "學習進展緩慢，需要更多耐心和堅持。基礎工作比追求高深更重要。",
        "出行": "可以出行，但需小心謹慎，不可冒險。該回來時就要及時返回。",
        "求職": "就業機會暫時有限，但不要放棄。時機到來時會有好的機會出現。",
        "官司": "訴訟對己不利，最好通過中介和解。不必爭一時意氣，以和為貴。",
        "失物": "失物在東南方向，需要反省自己的過失。物品可能尚存，需要用心尋找。",
        "疾病": "病情可以醫治，有痊癒的希望。需要耐心治療，不可急躁。",
        "買賣": "生意興衰交替，令人無奈。這是世道常情，只好忍耐等待時機。",
        "求子": "人丁平安，雖無突出之處，但平凡已足夠令人滿足。"
      },
      "historical_context": {
        "呂蒙正守困": "北宋呂蒙正，字聖功，河南人。父親呂龜圖與母親不合，蒙正少時貧困，曾投靠龍門山洞穴中苦讀。後在太宗時舉試第一，官至宰相，累封許國公，諡文穆。其早年困頓但後來飛黃騰達的經歷，正應了此籤先困後通的寓意。"
      },
      "symbolism": "子丑交替象徵時運的轉換，蕭索的秋日代表當前的困境，回春則象徵希望和新生。三般不自由指壽、富、貴三樣都不能自主，但天命有時，終會轉機。"
    },
    "en_US": {
      "title": "Slip #5: Lu Mengzheng Endures Hardship | Jia-Wu | Moderate Peace",
      "content": "Three aspects of life are beyond your control,\nThe courtyard stands desolate, cold as autumn's toll.\nWhen Ox and Rat exchange their destined day,\nAll things return to spring, worries fade away.",
      "basic_interpretation": "Currently, nothing can go according to your wishes, even simple communication fails to convey your meaning, like the desolation of autumn with a cold, empty courtyard. But misfortune will eventually end. When the Zi-Chou transition occurs (Rat-Ox exchange), like spring's arrival, all things will revive and there's no need to worry. This is the darkness before dawn - patience is required while waiting for the turning point.",
      "detailed_breakdown": {
        "Fame": "Despite diligent efforts, success is temporarily invisible. Fortune is declining with no light in sight. But there will eventually be a breakthrough - persistence is key.",
        "Wealth": "Currently no profit to be made. Though hardworking people deserve rewards, poor timing requires endurance. Future opportunities will arise.",
        "Marriage": "An ordinary couple can be content. Accept the destined relationship. Careful consideration is needed - don't be hasty.",
        "Health": "The body needs care and recovery. You've weathered dangerous times, fortunately with timely treatment. Avoid superstition and maintain rational clarity.",
        "Studies": "Academic progress is slow, requiring more patience and persistence. Foundation work is more important than pursuing advanced topics.",
        "Travel": "Travel is possible but requires careful caution - don't take risks. Return promptly when it's time.",
        "Employment": "Job opportunities are temporarily limited, but don't give up. Good chances will appear when timing improves.",
        "Legal Matters": "Litigation is unfavorable to you. Best to settle through mediation. Don't argue for momentary pride - harmony is precious.",
        "Lost Items": "Lost items are in the southeast direction. Reflect on your own mistakes. Items may still exist - search carefully.",
        "Illness": "The condition can be treated with hope for recovery. Patient treatment is needed - don't be impatient.",
        "Business": "Business cycles between prosperity and decline frustratingly. This is the way of the world - endure and wait for opportunity.",
        "Conception": "Family members are safe. Though nothing stands out, ordinary contentment is sufficient satisfaction."
      },
      "historical_context": {
        "Lu Mengzheng Endures Hardship": "Northern Song Dynasty's Lu Mengzheng, courtesy name Shenggong, from Henan. His father Lu Guitu didn't get along with his mother. Mengzheng was poor in youth and once took refuge in caves at Dragon Gate Mountain to study hard. Later, during Emperor Taizong's reign, he placed first in the imperial examination, became prime minister, was ennobled as Duke of Xu, and received the posthumous title Wenmu. His early hardships followed by great success perfectly embodies this divination's meaning of hardship before prosperity."
      },
      "symbolism": "The Zi-Chou transition symbolizes the change of fortune, the desolate autumn represents current difficulties, while spring's return symbolizes hope and renewal. 'Three aspects not free' refers to longevity, wealth, and status being beyond personal control, but Heaven's timing will eventually bring change."
    }
  }
}