{
  "slip_5": {
    "zh_CN": {
      "title": "第五签 吕蒙正守困 甲戊 中平",
      "content": "子有三般不自由，门庭萧索冷如秋\n若逢牛鼠交承日，万事回春不用忧",
      "basic_interpretation": "此时万事都无法随心所欲，就算是最简单的沟通都词不达意，连朋友都忘了你的存在，可说是冷到了极点。厄运总是会结束的，只要过了子丑的交接转换，就会有美好的未来，会犹如春天的来到，将不必忧愁，此时只是日出前的黑暗。",
      "detailed_breakdown": {
        "功名": "勤再拼也，或时运衰，不见曙光，明必有中",
        "六甲": "调养吾身，以备战斗，耗费身心，方可胜算",
        "求财": "勤业之人，本有报酬，惟时不济，只好忍受",
        "婚姻": "平凡夫妻，亦可足矣，命中注定，只好认之",
        "农畜": "多此一举，或为如此，虽是白工，宜足意也",
        "失物": "失于东南，宜省吾心，己之过失，物者尚存",
        "生意": "兴与衰交，令人无奈，世况如此，只好忍之",
        "丁口": "人人平安，惟无凸出，亦复何书，平凡足矣",
        "出行": "可行者也，但愿小心，岂可冒险，该回即回",
        "疾病": "一度历险，幸及时医，不宜迷之，人智清醒",
        "官司": "告官损己，利于中介，伊亦为财，不必意气",
        "时运": "平凡之命，平衡收支，景气不宜，即可满足"
      },
      "historical_context": {
        "吕蒙正守困": "宋朝吕蒙正，字圣初，河南人。父龟图与母不合，蒙正幼时贫甚，投迹龙门，凿山岩为龛，禁足不出，守困数年。太宗时举延试第一，二历相府，以直道自持，拜太师致仕归，累封许国公，卒谥文穆。此典故说明困境中坚持不懈，终会苦尽甘来。"
      },
      "symbolism": "子有三般指寿、富、贵三种福分，目前受困但未来可期。门庭萧索如秋日凄凉，但春回大地时万物复苏。子丑交承象征时运转换，困顿将尽，春光将至。"
    },
    "en_US": {
      "title": "Slip #5: Lu Mengzheng Endures Hardship | Jia-Wu | Neutral Average",
      "content": "Three freedoms are constrained, none your own,\nYour courtyard stands empty, cold as stone.\nWhen ox and rat succeed in their turn,\nAll things will flourish, no need to mourn.",
      "basic_interpretation": "Currently, everything feels beyond your control, even simple communication fails to convey your meaning, and friends seem to have forgotten your existence - truly a chilling situation. However, misfortune always comes to an end. Once the transition between Zi and Chou periods passes, a beautiful future awaits, like spring's arrival that brings warmth and hope. This is merely the darkness before dawn.",
      "detailed_breakdown": {
        "Career": "Despite diligent efforts, fortune declines and progress seems invisible, but success will eventually come.",
        "Conception": "Nurture your body and prepare for the battle; though it exhausts mind and spirit, victory is achievable.",
        "Wealth": "Hardworking people deserve rewards, but timing is poor - patience and endurance are required.",
        "Marriage": "An ordinary couple can be sufficient; what's destined by fate must be accepted.",
        "Agriculture": "Though efforts seem excessive or futile, and labor appears wasted, contentment should be maintained.",
        "Lost Items": "Lost in the southeast direction; reflect on your heart - through personal faults, the item may still exist.",
        "Business": "Prosperity and decline alternate frustratingly; such are worldly conditions - endurance is necessary.",
        "Family": "Everyone is safe though no one stands out; nothing to complain about - ordinary life is sufficient.",
        "Travel": "Travel is possible, but be cautious; don't take risks, return when appropriate.",
        "Illness": "Though once dangerous, timely medical care helped; don't be confused - maintain clear judgment.",
        "Legal Matters": "Suing officials harms yourself; mediation is beneficial, though costly - don't act on impulse.",
        "Fortune": "An ordinary fate with balanced income and expenses; when economy is poor, satisfaction is enough."
      },
      "historical_context": {
        "Lu Mengzheng Endures Hardship": "During the Song Dynasty, Lu Mengzheng, courtesy name Shengchu, was from Henan. His father Guitu did not get along with his mother, so Lu Mengzheng lived in extreme poverty during his youth. He took refuge at Dragon Gate, carved a cave in the mountain rock, and secluded himself there for several years enduring hardship. During Emperor Taizong's reign, he passed the imperial examination with first place, served twice as prime minister, maintained his integrity, was appointed Grand Tutor upon retirement, was enfeoffed as Duke of Xu, and posthumously titled Wenmu. This story illustrates that perseverance through adversity eventually leads to prosperity."
      },
      "symbolism": "The 'three aspects' refer to longevity, wealth, and nobility - currently constrained but promising for the future. The desolate courtyard represents autumn's bleakness, but when spring returns, all things revive. The succession of Zi and Chou symbolizes fortune's transformation - hardship will end and prosperity will come."
    },
    "zh_TW": {
      "title": "第五籤 呂蒙正守困 甲戊 中平",
      "content": "子有三般不自由，門庭蕭索冷如秋\n若逢牛鼠交承日，萬事回春不用憂",
      "basic_interpretation": "此時萬事都無法隨心所欲，就算是最簡單的溝通都詞不達意，連朋友都忘了你的存在，可說是冷到了極點。厄運總是會結束的，只要過了子丑的交接轉換，就會有美好的未來，會猶如春天的來到，將不必憂愁，此時只是日出前的黑暗。",
      "detailed_breakdown": {
        "功名": "勤再拼也，或時運衰，不見曙光，明必有中",
        "六甲": "調養吾身，以備戰鬥，耗費身心，方可勝算",
        "求財": "勤業之人，本有報酬，惟時不濟，只好忍受",
        "婚姻": "平凡夫妻，亦可足矣，命中註定，只好認之",
        "農畜": "多此一舉，或為如此，雖是白工，宜足意也",
        "失物": "失於東南，宜省吾心，己之過失，物者尚存",
        "生意": "興與衰交，令人無奈，世況如此，只好忍之",
        "丁口": "人人平安，惟無凸出，亦復何書，平凡足矣",
        "出行": "可行者也，但願小心，豈可冒險，該回即回",
        "疾病": "一度歷險，幸及時醫，不宜迷之，人智清醒",
        "官司": "告官損己，利於中介，伊亦為財，不必意氣",
        "時運": "平凡之命，平衡收支，景氣不宜，即可滿足"
      },
      "historical_context": {
        "呂蒙正守困": "宋朝呂蒙正，字聖初，河南人。父龜圖與母不合，蒙正幼時貧甚，投跡龍門，鑿山岩為龕，禁足不出，守困數年。太宗時舉延試第一，二歷相府，以直道自持，拜太師致仕歸，累封許國公，卒諡文穆。此典故說明困境中堅持不懈，終會苦盡甘來。"
      },
      "symbolism": "子有三般指壽、富、貴三種福分，目前受困但未來可期。門庭蕭索如秋日淒涼，但春回大地時萬物復甦。子丑交承象徵時運轉換，困頓將盡，春光將至。"
    }
  },
  "slip_6": {
    "zh_CN": {
      "title": "第六签 相如完璧归赵 甲己 下平",
      "content": "何劳鼓瑟更吹笙，寸步如登万里程\n彼此怀疑不相信，休将私意忆浓情",
      "basic_interpretation": "虽然你以很热忱的心与人交往，但对方却是个里外不一的人，看起来和你是那么近的距离，但却永远也无法知道对方在想什么，显得相当陌生。如果你还陷在过去的浓情蜜意之中，将自己沉浸在过去，将万劫不复，因为彼此已经产生了怀疑，倒不如就此放下。",
      "detailed_breakdown": {
        "功名": "己功名绝，不宜再想，改行可也，行行状元",
        "六甲": "出自命中，无子女命，惟科技昌，不妨试之", 
        "求财": "虽是劳心，劳力赴之，皆归原头，两手皆空",
        "婚姻": "不合姻缘，该分手去，以免遗憾，命中注定",
        "农牧": "天时地利，人和皆无，岂有利也，待明春可",
        "失物": "已无着也，物小难觅，宜自省之，训勉已可",
        "生意": "存欺人心，天在操之，资本耗尽，空空如也",
        "丁口": "人皆凉薄，无人突出，只为家计，令人鼻酸",
        "出行": "是地不毛，明知不可，不宜勉强，伤我身心",
        "疾病": "年逾耄耋，尚有一息，唯赖药器，恐难复之",
        "官司": "清夜扪心，明知胜败，不宜再战，偃旗息鼓",
        "时运": "不济之年，四两命也，胜万斤力，不宜冒险"
      },
      "historical_context": {
        "相如完璧归赵": "战国时，蔺相如为赵人。时赵有良璧，秦请易以十五城。相如奉璧入秦，而秦负约。相如将璧先使舍人怀归，以理折服秦王，完璧归赵。相如在赵，秦终不能胜赵。此典故说明在互不信任的环境中，需要智慧和勇气来维护自身利益。"
      },
      "symbolism": "鼓瑟吹笙象征表面和谐但内心疏离，寸步万里程喻指心理距离遥远。彼此怀疑表明信任破裂，私意浓情提醒勿沉溺过往。整体寓意人际关系出现裂痕，宜理智处理，不可强求。"
    },
    "en_US": {
      "title": "Slip #6: Lin Xiangru Returns the Jade Intact to Zhao | Jia-Ji | Lower Average",
      "content": "Why labor with zither and flute to play,\nEach step feels like a thousand miles away.\nMutual doubts and mistrust fill the air,\nRelease private thoughts, let go of love's care.",
      "basic_interpretation": "Though you approach others with sincere enthusiasm, they remain inconsistent and unpredictable. Though physically close, you can never truly know their thoughts, creating emotional distance. If you continue dwelling on past intimacy and romantic feelings, you'll become trapped in the past with no redemption. Since mutual suspicion has already emerged, it's better to let go now rather than continue struggling.",
      "detailed_breakdown": {
        "Career": "Your career prospects are severed; don't dwell on them anymore. Consider changing fields - every profession can produce a champion.",
        "Conception": "This comes from fate itself; you're destined to have no children. However, with advancing technology, it's worth trying modern methods.",
        "Wealth": "Though you toil mentally and physically, everything returns to square one, leaving you empty-handed.",
        "Marriage": "This is an incompatible match; you should separate to avoid future regrets. It's determined by fate.",
        "Agriculture": "Neither heaven's timing, earth's favor, nor human harmony are present. How can there be profit? Wait until next spring.",
        "Lost Items": "Already gone without trace; small items are hard to find. Better to reflect on yourself - this lesson is sufficient.",
        "Business": "Harboring deceptive intentions, heaven is watching. Capital will be exhausted, leaving you with nothing.",
        "Family": "People are all indifferent; no one stands out. Living only for household expenses is heartbreaking.",
        "Travel": "The destination is barren; knowing it's impossible, don't force it, lest you harm your body and mind.",
        "Illness": "Though advanced in years with only a breath left, relying solely on medicine and devices may not restore health.",
        "Legal Matters": "Examining your conscience in the quiet night, you know the outcome. Don't continue fighting - surrender and withdraw.",
        "Fortune": "This is an unlucky year; having a light destiny is more valuable than tremendous strength. Don't take risks."
      },
      "historical_context": {
        "Lin Xiangru Returns the Jade Intact to Zhao": "During the Warring States period, Lin Xiangru was from the state of Zhao. When Zhao possessed a precious jade, the state of Qin requested to exchange it for fifteen cities. Lin Xiangru carried the jade to Qin, but Qin broke their promise. Lin Xiangru had his attendant secretly carry the jade back home, then used reasoning to convince the Qin king, returning the jade intact to Zhao. With Lin Xiangru in Zhao, Qin could never defeat Zhao. This story illustrates the need for wisdom and courage to protect one's interests in an environment of mutual distrust."
      },
      "symbolism": "Playing zither and flute symbolizes surface harmony with inner alienation; each step being like a thousand miles represents vast psychological distance. Mutual suspicion indicates broken trust, while private romantic thoughts warn against dwelling on the past. Overall, this signifies rifts in relationships that should be handled rationally without forcing outcomes."
    },
    "zh_TW": {
      "title": "第六籤 相如完璧歸趙 甲己 下平", 
      "content": "何勞鼓瑟更吹笙，寸步如登萬里程\n彼此懷疑不相信，休將私意憶濃情",
      "basic_interpretation": "雖然你以很熱忱的心與人交往，但對方卻是個裡外不一的人，看起來和你是那麼近的距離，但卻永遠也無法知道對方在想什麼，顯得相當陌生。如果你還陷在過去的濃情蜜意之中，將自己沉浸在過去，將萬劫不復，因為彼此已經產生了懷疑，倒不如就此放下。",
      "detailed_breakdown": {
        "功名": "己功名絕，不宜再想，改行可也，行行狀元",
        "六甲": "出自命中，無子女命，惟科技昌，不妨試之",
        "求財": "雖是勞心，勞力赴之，皆歸原頭，兩手皆空",
        "婚姻": "不合姻緣，該分手去，以免遺憾，命中註定",
        "農牧": "天時地利，人和皆無，豈有利也，待明春可",
        "失物": "已無著也，物小難覓，宜自省之，訓勉已可",
        "生意": "存欺人心，天在操之，資本耗盡，空空如也",
        "丁口": "人皆涼薄，無人突出，只為家計，令人鼻酸",
        "出行": "是地不毛，明知不可，不宜勉強，傷我身心",
        "疾病": "年逾耄耋，尚有一息，唯賴藥器，恐難復之",
        "官司": "清夜捫心，明知勝敗，不宜再戰，偃旗息鼓",
        "時運": "不濟之年，四兩命也，勝萬斤力，不宜冒險"
      },
      "historical_context": {
        "相如完璧歸趙": "戰國時，藺相如為趙人。時趙有良璧，秦請易以十五城。相如奉璧入秦，而秦負約。相如將璧先使舍人懷歸，以理折服秦王，完璧歸趙。相如在趙，秦終不能勝趙。此典故說明在互不信任的環境中，需要智慧和勇氣來維護自身利益。"
      },
      "symbolism": "鼓瑟吹笙象徵表面和諧但內心疏離，寸步萬里程喻指心理距離遙遠。彼此懷疑表明信任破裂，私意濃情提醒勿沉溺過往。整體寓意人際關係出現裂痕，宜理智處理，不可強求。"
    }
  }
}